'''
·打印浮点数，精度2
·打印浮点数，宽度10，精度2
·打印浮点数，宽度10，精度2，用科学计数法表示
·打印浮点数，宽度10，精度2，用百分数表示
·打印浮点数，宽度10，精度2，左对齐打印
·打印浮点数，宽度10，精度2，右对齐打印
·打印整数，宽度10，分别以二、八、十、十六进制打印
·打印字符串，宽度10，左对齐打印
·打印字符串，宽度10，右对齐打印
·打印四个臭屌丝的名字，逗号分隔，分号结束
·以优美的格式打印一首好诗
·打印个人信息，包括姓名、年龄、财产
'''

result = format(10/3,".2f")
print("%.2f"%(10/3))

result = format(10/3,"10.2f")
print("%10.2f"%(10/3))

result = format(1234567890987654321,"10.2e")
print("%10.2e"%(1234567890987654321))

result = format(0.00000000000012345,"10.2e")
result = format(1/3,"10.2%")
print("%10.2f-%%"%(33.333333))#百分号的打印方式

result1 = format(1/3,"<10.2%")
result2 = format(1/3,">10.2%")
result = format(123,"10b")
result = format(123,"10x")
result = format(123,"10o")
result = format(123,"10d")
result = format("hello","10s")
result = format("hello","<10s")
result = format("hello",">10s")

# print(result)
# print(result1)
# print(result2)

# print("悔创阿里杰克马","一无所有王健林","不识妻美刘强东","普通家庭马化腾")
# print("悔创阿里杰克马","一无所有王健林","不识妻美刘强东","普通家庭马化腾",sep='&')
# print("悔创阿里杰克马",end='；')
# print("一无所有王健林",end='；')
# print("不识妻美刘强东",end='；')
# print("普通家庭马化腾",end='；')

# print('''
#      征友启事
# 家穷人丑，一米四九
# 小学文化，农村户口
# 破屋三间，薄田两口
# 冷锅冷灶，老婆没有
# 一年四季，药不离口
# 今日上网，诚征女友
#     ——拍森1703宣
# ''')

print("我的名字是【%s】，今年%d岁了，过年时收到压岁钱%.2f"%("杰克逊马",20,-12345.67))
